package com.hoo.bean;

/**
 * <pre>
 * <p>Title: </p>
 * <p>Description: 错误编码说明：错误编码共六位， 前两位表示错误级别，中间两位为模块，后两位为错误错误编码，
 * 				   错误级别：10:系统级别，20：服务级别
 * 				   模块：00：系统模块，01：数据查询模块，02：运维模块，03：预处理模块，04：数据分析模块
 * 				   eg：100101
 * 				   10为系统级别错误，01为模块，01为错误编码</p>
 * <p>Copyright: Copyright (c) 2010 - 2016 </p>
 * <p>Company: Beijing jcfy Technology Co.,Ltd. </p>
 * <p>Build: 2016年11月7日 下午6:26:05 </p>
 * </pre>
 *
 * @author Chang Yuxin
 * @version 1.0
 */
public enum Error {
	//----------------------------------------系统
	/** 系统异常 */
	_100000("100000", "系统异常"),
	/** 未登录或会话已超时 */
	_100001("100001", "未登录或会话已超时"),
	/** 无效参数 */
	_100002("100002", "无效参数"),
	/** 签名效验失败 */
	_100003("100003", "签名效验失败"),
	/** 单点登录 */
	_100004("100004", "用户已登录"),

	//----------------------------------------用户模块
	/** 账号不存在 */
	_200101("200101", "账号不存在"),
	/** 账号已冻结 */
	_200102("200102", "账号已冻结"),
	_200103("200103", "统计数据失败"),
	_200104("200104", "统计数据无结果"),
	/** 表单未填写完整 */
	_200105("200105", "表单未填写完整"),
	/** 账号或密码错误 */
	_200106("200106", "账号或密码错误"),
	/** 短息发送失败 */
	_200107("200107", "短息发送失败"),
	/** 验证错误 */
	_200108("200108" , "验证码错误"),
	_200109("200109" , "验证码超时"),
	_200110("200110" , "验证码发送失败"),

	//----------------------------------------手机号及密码验证
	/** 手机号已存在*/
	_200113("200113", "手机号已存在"),
	/** 手机号格式错误 */
	_200114("200114", "手机号格式错误"),
	/** 手机号不正确 */
	_200115("200115", "手机号不正确"),
	/**密码不符合规定 */
	_200116("200116", "密码不符合规定"),
	/**密码错误 */
	_200117("200117", "密码错误"),
	/**旧密码输入错误 */
	_200118("200118", "旧密码输入错误"),
	/**两次密码输入不一致 */
	_200119("200119", "两次密码输入不一致"),
	/**电话号码不存在 */
	_200120("200120", "电话号码不存在"),

	//----------------------------------------微信公众号授权
	/** 用户取消授权或授权失败 */
	_200121("200121", "取消授权或授权失败"),
	_200122("200122", "获取access_token失败"),
	_200123("200123", "刷新access_token失败"),
	_200124("200124", "拉取用户信息失败"),
	_200125("200125", "跳转绑定手机页"),

	//----------------------------------------数据运维模块
	_200201("200201" , "操作失败"),
	_200202("200202", " 请先把表单填写完整！"),
	_200203("200203", " 参数为空！"),
	_200204("200204", " 参数长度超长，最大:"),
	/**查询无结果 */
	_200205("200205", " 查询无结果"),
	_200206("200206", " 更新失败！"),
	_200207("200207", " 删除失败！"),
	_200208("200208", " 请输入数字！"),
	_200209("200209", " 不能小于1 ！"),
	_200210("200210", " 不能大于100 ！"),
	_200211("200211", " 添加失败！"),
	_200212("200212", " 参数重复！"),
	_200213("200213", " 数据错误！"),

	//----------------------------------------订单模块
	_200221("200221", "订单已存在"),
	_200222("200222", "订单创建失败"),
	_200223("200223", "您还没订阅该产品或订阅已到期");


	/** 错误编码 */
	private String errorCode;

	/** 错误信息 */
	private String errorMsg;

	private Error(String errorCode, String errorMsg) {
		this.errorCode = errorCode;
		this.errorMsg = errorMsg;
	}

	/**
	 * @return the errorCode
	 */
	public String getErrorCode() {
		return errorCode;
	}

	/**
	 * @param name
	 * @return String
	 */
	public static String code(String name){
		return Error.valueOf(name).errorCode;
	}

	/**
	 * @param errorCode the errorCode to set
	 */
	public void setErrorCode(String errorCode) {
		this.errorCode = errorCode;
	}

	/**
	 * @return the errorMsg
	 */
	public String getErrorMsg() {
		return errorMsg;
	}

	/**
	 * @param name
	 * @return String
	 */
	public static String msg(String name){
		return Error.valueOf(name).errorMsg;
	}

	/**
	 * @param errorMsg the errorMsg to set
	 */
	public void setErrorMsg(String errorMsg) {
		this.errorMsg = errorMsg;
	}
}
